report/sysbench/MySQL_PG_test/oltp_update_non_index.master_mysql_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 20643.08 qps: 20643.08 (r/w/o: 0.00/20643.08/0.00) lat (ms,99%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 21677.46 qps: 21677.46 (r/w/o: 0.00/21677.46/0.00) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 23284.69 qps: 23284.69 (r/w/o: 0.00/23284.69/0.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 17417.81 qps: 17417.81 (r/w/o: 0.00/17417.81/0.00) lat (ms,99%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 16395.80 qps: 16395.80 (r/w/o: 0.00/16395.80/0.00) lat (ms,99%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 16690.20 qps: 16690.20 (r/w/o: 0.00/16690.20/0.00) lat (ms,99%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 17543.58 qps: 17543.58 (r/w/o: 0.00/17543.58/0.00) lat (ms,99%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 16927.81 qps: 16927.81 (r/w/o: 0.00/16927.81/0.00) lat (ms,99%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 15639.73 qps: 15639.73 (r/w/o: 0.00/15639.73/0.00) lat (ms,99%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 14833.26 qps: 14833.26 (r/w/o: 0.00/14833.26/0.00) lat (ms,99%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 14403.96 qps: 14403.96 (r/w/o: 0.00/14403.96/0.00) lat (ms,99%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 16690.48 qps: 16690.48 (r/w/o: 0.00/16690.48/0.00) lat (ms,99%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 14423.51 qps: 14423.51 (r/w/o: 0.00/14423.51/0.00) lat (ms,99%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 14650.85 qps: 14650.85 (r/w/o: 0.00/14650.85/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 14897.44 qps: 14897.44 (r/w/o: 0.00/14897.44/0.00) lat (ms,99%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 14872.89 qps: 14872.89 (r/w/o: 0.00/14872.89/0.00) lat (ms,99%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 15597.31 qps: 15597.31 (r/w/o: 0.00/15597.31/0.00) lat (ms,99%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 15804.72 qps: 15804.72 (r/w/o: 0.00/15804.72/0.00) lat (ms,99%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 14616.45 qps: 14616.45 (r/w/o: 0.00/14616.45/0.00) lat (ms,99%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 13557.86 qps: 13557.86 (r/w/o: 0.00/13557.86/0.00) lat (ms,99%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 16048.03 qps: 16048.03 (r/w/o: 0.00/16048.03/0.00) lat (ms,99%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 15606.21 qps: 15606.21 (r/w/o: 0.00/15606.21/0.00) lat (ms,99%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 14819.44 qps: 14819.44 (r/w/o: 0.00/14819.44/0.00) lat (ms,99%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 13297.32 qps: 13297.32 (r/w/o: 0.00/13297.32/0.00) lat (ms,99%): 102.97 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1951938
        other:                           0
        total:                           1951938
    transactions:                        1951938 (16261.72 per sec.)
    queries:                             1951938 (16261.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0313s
    total number of events:              1951938

Latency (ms):
         min:                                    1.39
         avg:                                   12.30
         max:                                  681.19
         99th percentile:                       92.42
         sum:                             24000753.05

Threads fairness:
    events (avg/stddev):           9759.6900/91.54
    execution time (avg/stddev):   120.0038/0.01